
[A_FireMagic_Skill H7Skill]
mName="Магия огня"
mTooltip="Позволяет изучать в гильдии магов заклинания магии огня, а также усиливать их и добавлять дополнительные эффекты."
mDescriptions[2]="Увеличивает эффективность заклинаний магии огня и повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний на 1."
mDescriptions[3]="Увеличивает эффективность заклинаний магии огня и дополнительно повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний на 2."
mDescriptions[4]="Увеличивает эффективность заклинаний магии огня и дополнительно повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний на 3."
mDescriptions[0]="Увеличивает эффективность заклинаний магии огня и повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний."
[A_Immolation_Ability H7HeroAbility]
mName="Жертвоприношение"
mTooltip="Заклинания "Огненная стрела" и "Огненный шар" с вероятностью 75% накладывают негативный эффект "Горение", нанося урон от магии огня в начале хода существа в течение 2 ходов."
[A_FireMantle_Ability H7HeroAbility]
mName="Мантия огня"
mTooltip="В ближнем бою дружественные отряды дополнительно наносят от %buff1.buff.d1.min до %buff1.buff.d1.max ед. урона от %buff1.buff.d1.icon магии огня. Они также наносят от %buff1.buff.d2.min до %buff1.buff.d2.max ед. урона от %buff1.buff.d2.icon магии огня противникам, которые атакуют их в ближнем бою."
[A_FireScholar_Ability H7HeroAbility]
mName="Искусный маг огня"
mTooltip="-%special.norm% к расходу маны на заклинания школы огня."
[A_FireWisdom_Ability H7HeroAbility]
mName="Мудрость огня"
mTooltip="%stat1 к %stat1.icon магии для заклинаний магии огня. Любой навык категории «Мудрость» дополнительно дает герою %stat1 к %stat1.icon магии."
[A_ArdentCaster_Buff_Might H7BaseBuff]
mName="Заклинатель пламени"
[A_ArdentCaster_Ability H7HeroAbility]
mName="Заклинатель пламени"
mTooltip="%buff.buff.buff.buff.stat к %buff.buff.buff.buff.stat.icon силе за каждое использованное заклинание магии огня. Действует до конца боя."
[A_FireMantle_Buff H7BaseBuff]
mName="Мантия огня"
mTooltip="В ближнем бою отряд дополнительно наносит от %d1.min до %d1.max ед. урона от %d1.icon магии огня. Он также наносит от %d2.min до %d2.max ед. урона от %d2.icon магии огня противникам, которые атакуют его в ближнем бою."
[A_MasterOfFire_I_Ability H7HeroAbility]
mName="Знание магии огня I"
mTooltip="%spell1.name: теперь заклинание дополнительно наносит от %spell1.spell.buff.buff.d.min до %spell1.spell.buff.buff.d.max ед. урона от %spell1.spell.buff.buff.d.icon магии огня в течение %spell1.spell.buff.buff.durini хода(ов).\n%spell2.name: теперь заклинание можно накладывать на отряды в выбранной области 4x4."
[A_MasterOfFire_II_Ability H7HeroAbility]
mName="Знание магии огня II"
mTooltip="%spell1.name: теперь заклинание можно накладывать на отряды в выбранной области 4x4.\n%spell2.name: теперь заклинание останавливает существ и наносит от %spell2.spell.buff3.buff.d.min до %spell2.spell.buff3.buff.d.max ед. урона от %ICON_FIRE магии огня в течение %spell2.spell.buff3.buff.durini хода(ов)."
[A_FireMantle_CreatureAbility H7CreatureAbility]
mName="Мантия огня"
mTooltip="+%d1 ед. урона от огня при атаке в ближнем бою. Противники, атакующие в ближнем бою, получают %d2 ед. урона от огня."
[A_PassionateCaster_Buff_Might H7BaseBuff]
mName="Мощь камня"
mTooltip="+ %stat к защите до конца боя."
[A_CatchingFire_Ability H7HeroAbility]
mName="Ловец огня"
mTooltip="Заклинания "Пламенная решимость" и "Внутреннее пламя" можно накладывать на все дружественные отряды в выбранной области 3x3."
[A_FocusedFrenzy_Ability H7HeroAbility]
mName="Сосредоточенное бешенство"
mTooltip="Отряды под действием заклинания "Берсерк" больше предпочитают нападать на вражеских существ, чем на дружественных."
mName="Знание магии огня I"
mTooltip="Заклинание "Огненная стрела" накладывает негативный эффект "Горение", наносящий урон от магии огня в начале хода существа в течение 3 ходов. Заклинание "Пламенная решимость" можно накладывать на все дружественные отряды в выбранной области 3x3."
[A_ImprovedTier2Spells_Ability H7HeroAbility]
mName="Знание магии огня II"
mTooltip="Заклинание "Внутреннее пламя" можно накладывать на все дружественные отряды в выбранной области 3x3. Заклинание "Огненная стена" не даёт существам пройти через свою обалсть действия."
[A_ImprovedTier3Spells_Ability H7HeroAbility]
mName="Знание магии огня III"
mTooltip="Отряды под действием заклинания "Берсерк" больше предпочитают нападать на вражеских существ, чем на дружественных. Заклинание "Огненный шар" накладывает негативный эффект "Горение", наносящий урон от магии огня в начале хода существа в течение 3 ходов.."
[A_PassionateCaster_Ability H7HeroAbility]
mName="Увлечённый заклинатель"
mTooltip="+1 к силе (максимум +5) за каждое использованное заклинание магии огня. Действует до конца боя."
[A_Pyromania_Ability H7HeroAbility]
mName="Пиромания"
mTooltip="Каждый раз, когда соседнее существо получает урон от магии огня, боевой дух отряда увеличивается на +5 до конца его следующего хода."
[A_Pyromania_Buff_FriendlyCreatures H7BaseBuff]
mName="Пиромания"
[A_Pyromania_Buff_HostileCreatures H7BaseBuff]
mName="Пиромания"
[A_Pyromania_Buff_MoraleIncrease H7BaseBuff]
mName="Пиромания"
mTooltip="Существо получает +%e к боевому духу."
[A_RepellingFlames_Ability H7HeroAbility]
mName="Отталкивающее пламя"
mTooltip="Нелетающие существа, вступившие в область действия стены огня, не могут двигаться дальше."


7.5_mod

[A_MasterOfFire_III_Ability H7HeroAbility]
mName="Знание магии огня III"
mTooltip="%spell1.name: отряд, выбранный целью этого заклинания, атакует с бонусом %spell1.spell.buff.stat7 к %ICON_ATTACK атаке, и в первую очередь нападает на вражеских существ.\n%spell2.name: теперь заклинание дополнительно наносит от %spell2.spell.buff.d.min до %spell2.spell.buff.d.max ед. урона от %spell2.spell.buff.buff.d.icon магии огня в течение %spell2.spell.buff.buff.durini хода(ов).\n%spell3: отряды, выбранные целью этого заклинания, получают отрицательный эффект - %spell3.spell.buff.buff.res к урону от %icon_fire магии огня в дополнение к нанесённому урону.\n%spell4.name: теперь заклинание снижает удачу выбранного отряда до %spell4.spell.buff2.buff.stat1 %icon_luck."             